In [111]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

In [112]:
df = pd.read_csv("./Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
df.shape

(891, 12)

In [114]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [115]:
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
214,215,0,3,"Kiernan, Mr. Philip",male,NaN,1,0,367229,7.75,NaN,Q

In [116]:
df.drop(columns=['PassengerId','Pclass','Name','SibSp','Parch','Ticket','Cabin'],inplace=True)

In [117]:
df.head()

   Survived     Sex   Age     Fare Embarked
0         0    male  22.0   7.2500        S
1         1  female  38.0  71.2833        C
2         1  female  26.0   7.9250        S
3         1  female  35.0  53.1000        S
4         0    male  35.0   8.0500        S

In [118]:
df.isnull().sum()

Survived      0
Sex           0
Age         177
Fare          0
Embarked      2
dtype: int64

In [119]:
X = df.drop(columns="Survived")
y = df["Survived"]
X.head()

      Sex   Age     Fare Embarked
0    male  22.0   7.2500        S
1  female  38.0  71.2833        C
2  female  26.0   7.9250        S
3  female  35.0  53.1000        S
4    male  35.0   8.0500        S

In [120]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=.2,stratify=y,random_state=42)

In [121]:
#impute the data
trf1 = ColumnTransformer(transformers=[
    ('age_impute',SimpleImputer(),[1]),
    ('embark_impute',SimpleImputer(strategy='most_frequent'),[3])
    
],remainder="passthrough")

In [122]:
#one hot encoding
trf2 = ColumnTransformer(transformers=[
      ('sex_ohe',OneHotEncoder(sparse_output=False,handle_unknown='ignore'),[0,3])
],remainder='passthrough')

In [123]:
#scaling
trf3 = ColumnTransformer(transformers=[
    ('standardizing',StandardScaler(),[1,2])
])

In [124]:
pipeline = Pipeline([
    ('trf1',trf1),
    ('trf2',trf2),
    ('trf3',trf3)
])

In [125]:
pipeline.fit_transform(X_train,y_train)

array([[-0.03750293, -0.03750293],
       [-0.03750293, -0.03750293],
       [-0.03750293, -0.03750293],
       ...,
       [-0.03750293, -0.03750293],
       [-0.03750293, -0.03750293],
       [-0.03750293, -0.03750293]])